In [6]:
import mysql.connector

connection_params = {
    'host': "localhost",
    'user': "root",
    'password': "antoine",
    'database': "school",
}

In [7]:
request = "SELECT \
    ROUND(AVG(`j`.`n`), 2) as `avg`, \
    `c`.`name`, \
    `c`.`id` \
FROM \
    `clients` as `c` \
    JOIN JSON_TABLE( \
        `c`.`scores`, \
        '$[*]' columns( \
            `n` decimal(8, 2) path '$' \
        ) \
    ) as `j` \
GROUP BY \
    `c`.`id`; \
"

In [8]:
print(request)

SELECT     ROUND(AVG(`j`.`n`), 2) as `avg`,     `c`.`name`,     `c`.`id` FROM     `clients` as `c`     JOIN JSON_TABLE(         `c`.`scores`,         '$[*]' columns(             `n` decimal(8, 2) path '$'         )     ) as `j` GROUP BY     `c`.`id`;

In [9]:
with mysql.connector.connect(**connection_params) as db :
    with db.cursor() as c:
        c.execute(request)
        for u in c.fetchall():
            print(u)

(Decimal('15.60'), 'Alan', 1)
(Decimal('15.60'), 'Alice', 2)
(Decimal('15.60'), 'Sophie', 3)
(Decimal('15.60'), 'Bernard', 4)
(Decimal('15.60'), 'Philippe', 5)
(Decimal('15.60'), 'Jérôme', 6)
(Decimal('15.60'), 'Céline', 7)
(Decimal('15.60'), 'Fenley', 8)
(Decimal('15.60'), 'Naoudi', 9)
(Decimal('15.60'), 'Sylvie', 10)
(Decimal('15.60'), 'Yvette', 11)
(Decimal('15.60'), 'Michel', 12)
(Decimal('15.60'), 'Nicolas', 13)
(Decimal('15.60'), 'Jean-Marie', 14)
(Decimal('15.60'), 'Guillaume', 15)

In [10]:
# Récupération des données du flux
with mysql.connector.connect(**connection_params) as db :
    with db.cursor() as c:
        c.execute(request)
        while True:
            u = c.fetchone()
            if u is None:
                break
            print(u)

(Decimal('15.60'), 'Alan', 1)
(Decimal('15.60'), 'Alice', 2)
(Decimal('15.60'), 'Sophie', 3)
(Decimal('15.60'), 'Bernard', 4)
(Decimal('15.60'), 'Philippe', 5)
(Decimal('15.60'), 'Jérôme', 6)
(Decimal('15.60'), 'Céline', 7)
(Decimal('15.60'), 'Fenley', 8)
(Decimal('15.60'), 'Naoudi', 9)
(Decimal('15.60'), 'Sylvie', 10)
(Decimal('15.60'), 'Yvette', 11)
(Decimal('15.60'), 'Michel', 12)
(Decimal('15.60'), 'Nicolas', 13)
(Decimal('15.60'), 'Jean-Marie', 14)
(Decimal('15.60'), 'Guillaume', 15)

In [11]:
# Récupération des données du flux
with mysql.connector.connect(**connection_params) as db :
    with db.cursor() as c:
        r = 'set @json=\' \
            [  \
              {"name":"Laptop", "color":"black", "price":"1000"},  \
              {"name":"Jeans",  "color":"blue"}  \
            ]\' ' ; \


        c.execute(r)

        r = ' select * from json_table(@json, \'$[*]\'  \
          columns( \
           name  varchar(10) path \'$.name\', \
           color varchar(10) path \'$.color\', \
           price d \
           ';
        c.execute(r)

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'd' at line 1